In [5]:
import mysql.connector
import pandas as pd

mydb = mysql.connector.connect(
  host="localhost",
  user="root",
  password="Test"
)

cursor = mydb.cursor()

In [6]:
!pip install mysql-connector-python

Requirement already satisfied: mysql-connector-python in c:\users\swapna\anaconda3\lib\site-packages (8.1.0)
Requirement already satisfied: protobuf<=4.21.12,>=4.21.1 in c:\users\swapna\anaconda3\lib\site-packages (from mysql-connector-python) (4.21.12)

In [7]:
#Droping database MYDATABASE if already exists.
cursor.execute("DROP database IF EXISTS Dataset1")

In [8]:
# Creating a Database
cursor.execute(" CREATE DATABASE Dataset1")

In [9]:
# SHOW DATABASES
cursor.execute("SHOW DATABASES")

for x in cursor:
    print(x)

('dataset1',)
('employees',)
('information_schema',)
('mydb',)
('mysql',)
('performance_schema',)
('power',)
('sakila',)
('sys',)
('world',)

In [10]:
# Use heights
cursor.execute("use Dataset1")

In [12]:
# Load Datasets to DB-heights
data = pd.read_csv("heights.csv")
data

          height
0     182.395153
1     177.369198
2     182.198838
3     176.988964
4     163.689656
...          ...
9995  172.694718
9996  184.422508
9997  193.775173
9998  185.282704
9999  178.123633

[10000 rows x 1 columns]

In [14]:
# Create Table heights
cursor.execute("create Table heights(height FLOAT)")

ProgrammingError: 1050 (42S01): Table 'heights' already exists

In [15]:
# INSERT VALUES INTO heights
for row in data.itertuples():
    sql = "INSERT INTO heights (height) VALUES (%(height)s)"
    val = {
        "height":row.height
        }  
    cursor.execute(sql, val)
    mydb.commit()

In [16]:
# Load Datasets to DB-auto_upgrades
data = pd.read_csv("auto_upgrades.csv")
data

    Sales
0    5000
1    1700
2    8200
3    1500
4    3300
5    9000
6    2000
7       0
8       0
9    2300
10   4700

In [17]:
# Create Table auto_upgrades
cursor.execute("create Table auto_upgrades(Sales FLOAT)")

In [18]:
# INSERT VALUES INTO auto_upgrades
for row in data.itertuples():
    sql = "INSERT INTO auto_upgrades (Sales) VALUES (%(Sales)s)"
    val = {
        "Sales":row.Sales
        }  
    cursor.execute(sql, val)
    mydb.commit()

In [20]:
# Load Datasets to DB-dealership
data = pd.read_csv("dealership.csv")
data

   Hours       Sales
0     40   179480.58
1     56  2495037.51
2     50  2285369.51
3     82  2367896.33
4     41  1309745.16
5     51   623013.69
6     45  2989943.37
7     90  1970316.24
8     47  1845840.39
9     72  2553231.33

In [21]:
# Create Table dealership
cursor.execute("create Table dealership(Hours INT , Sales FLOAT)")

In [22]:
# INSERT VALUES INTO dealership
for row in data.itertuples():
    sql = "INSERT INTO dealership (Hours,Sales) VALUES ( %(Hours)s ,%(Sales)s)"
    val = {
        "Hours":row.Hours,
        "Sales":row.Sales
    }  
    cursor.execute(sql, val)
    mydb.commit()

In [23]:
#Doping database MYDATABASE if already exists.
cursor.execute("DROP database IF EXISTS Demo")

In [24]:
#Preparing query to create a database
sql = "CREATE database Demo";

In [25]:
#Creating a database
cursor.execute(sql)

In [26]:
#Retrieving the list of databases
cursor.execute("SHOW DATABASES")

for x in cursor:
    print(x)

('dataset1',)
('demo',)
('employees',)
('information_schema',)
('mydb',)
('mysql',)
('performance_schema',)
('power',)
('sakila',)
('sys',)
('world',)

In [27]:
#Python Mysql - Use Database
cursor.execute("use Demo")

In [28]:
#Dropping Table if already Exists
cursor.execute("drop table if exists Iris")

In [29]:
#Python-Mysql - Create Table
cursor.execute("create Table Iris(Id INT,SepalLengthCm FLOAT , SepalWidthCm FLOAT, PetalLengthCm FLOAT, PetalWidthCm FLOAT , Species VARCHAR(16))")

In [30]:
# Load Datasets to DB-Iris
data = pd.read_csv("Iris.csv")
data

      Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm Species_Id
0      1            5.1           3.5            1.4           0.2          A
1      2            4.9           3.0            1.4           0.2          A
2      3            4.7           3.2            1.3           0.2          A
3      4            4.6           3.1            1.5           0.2          A
4      5            5.0           3.6            1.4           0.2          A
..   ...            ...           ...            ...           ...        ...
145  146            6.7           3.0            5.2           2.3          C
146  147            6.3           2.5            5.0           1.9          C
147  148            6.5           3.0            5.2           2.0          C
148  149            6.2           3.4            5.4           2.3          C
149  150            5.9           3.0            5.1           1.8          C

[150 rows x 6 columns]

In [31]:
#Load csv into db
for row in data.itertuples():
    sql = "INSERT INTO Iris (Id, SepalLengthCm, SepalWidthCm, PetalLengthCm, PetalWidthCm ,Species) VALUES (%(Id)s, %(SepalLengthCm)s, %(SepalWidthCm)s, %(PetalLengthCm)s, %(PetalWidthCm)s, %(Species)s)"
    val = {
        "Id":row.Id,
        "SepalLengthCm":row.SepalLengthCm,
        "SepalWidthCm":row.SepalWidthCm,
        "PetalLengthCm":row.PetalLengthCm,
        "PetalWidthCm": row.PetalWidthCm,
        "Species":row.Species_Id     
    }  
    cursor.execute(sql, val)
    mydb.commit()

In [32]:
#Retrieving single row
sql = '''SELECT * from Iris'''

#Executing the query
cursor.execute(sql)

#Fetching 1st row from the table
result = cursor.fetchmany(size =1); # can control the rows outcomes
print(result)

[(1, 5.1, 3.5, 1.4, 0.2, 'A')]

In [ ]:
import mysql.connector
import pandas as pd

mydb = mysql.connector.connect(
  host="localhost",
  user="root",
  password="test"
)

cursor = mydb.cursor()

In [ ]:
#Doping database MYDATABASE if already exists.
cursor.execute("DROP database IF EXISTS Datasets")

In [ ]:
# Creating a Database
cursor.execute(" CREATE DATABASE Datasets")

In [ ]:
# SHOW DATABASES
cursor.execute("SHOW DATABASES")

for x in cursor:
    print(x)

In [ ]:
# Use heights
cursor.execute("use Datasets")

In [ ]:
# Load Datasets to DB-Iris
data = pd.read_csv("./Datasets/Iris.csv")
data

In [ ]:
cursor.execute("create Table Iris(Id INT,SepalLengthCm FLOAT , SepalWidthCm FLOAT, PetalLengthCm FLOAT, PetalWidthCm FLOAT , Species VARCHAR(16))")

In [ ]:
for row in data.itertuples():
    sql = "INSERT INTO Iris (Id, SepalLengthCm, SepalWidthCm, PetalLengthCm, PetalWidthCm ,Species) VALUES (%(Id)s, %(SepalLengthCm)s, %(SepalWidthCm)s, %(PetalLengthCm)s, %(PetalWidthCm)s, %(Species)s)"
    val = {
        "Id":row.Id,
        "SepalLengthCm":row.SepalLengthCm,
        "SepalWidthCm":row.SepalWidthCm,
        "PetalLengthCm":row.PetalLengthCm,
        "PetalWidthCm": row.PetalWidthCm,
        "Species":row.Species_Id     
    }  
    cursor.execute(sql, val)
    mydb.commit()

In [ ]:
#Doping database MYDATABASE if already exists.
cursor.execute("DROP database IF EXISTS joins")

In [ ]:
# Create Database 
cursor.execute("create database joins")

In [ ]:
# SHOW DATABASES
cursor.execute("SHOW DATABASES")

for x in cursor:
    print(x)

In [ ]:
# Use Joins db
cursor.execute("use joins")

In [ ]:
# Load Datasets to DB-Iris
data = pd.read_csv("./Datasets/Iris.csv")
data

In [ ]:
# Create Table Iris-sepal
cursor.execute("create Table Iris_sepal(Id INT PRIMARY KEY, SepalLengthCm FLOAT , SepalWidthCm FLOAT , Species_Id varchar(2) )")

In [ ]:
# Insert into Iris_sepal
for row in data.itertuples():
    sql = "INSERT INTO Iris_sepal (Id, SepalLengthCm, SepalWidthCm, Species_Id) VALUES (%(Id)s, %(SepalLengthCm)s, %(SepalWidthCm)s, %(Species_Id)s) "
    val = {
        "Id":row.Id,
        "SepalLengthCm":row.SepalLengthCm,
        "SepalWidthCm":row.SepalWidthCm,
        "Species_Id": row.Species_Id
    }  
    cursor.execute(sql, val)
    mydb.commit()

In [ ]:
# Create Table Iris-petal
cursor.execute("create Table Iris_petal(Id INT  PRIMARY KEY ,  PetalLengthCm FLOAT, PetalWidthCm FLOAT , Species_Id varchar(2) )")

In [ ]:
# Insert into Iris_petal
for row in data.itertuples():
    sql = "INSERT INTO Iris_petal (Id,  PetalLengthCm, PetalWidthCm, Species_Id ) VALUES (%(Id)s, %(PetalLengthCm)s, %(PetalWidthCm)s, %(Species_Id)s )"
    val = {
        "Id":row.Id,
        "PetalLengthCm":row.PetalLengthCm,
        "PetalWidthCm": row.PetalWidthCm,
        "Species_Id": row.Species_Id
    }  
    cursor.execute(sql, val)
    mydb.commit()

In [ ]:
# Load Datasets to DB-Iris
data = pd.read_csv("./Datasets/Iris_species.csv")
data

In [ ]:
# Create Table Iris_species
cursor.execute("create Table Iris_species(Id INT ,Species_Id VARCHAR(2) PRIMARY KEY , Species VARCHAR(16))")

In [ ]:
# Insert into Iris_species
for row in data.itertuples():
    sql = "INSERT INTO Iris_species (Id,Species_Id , Species) VALUES (%(Id)s,%(Species_Id)s ,%(Species)s)"
    val = {
        "Id":row.Id,
        "Species_Id": row.Species_Id,
        "Species":row.Species     
    }  
    cursor.execute(sql, val)
    mydb.commit()

In [ ]:
# Select Table Iris_petal
pd.read_sql_query("select * from Iris_petal",mydb)

In [ ]:
# Select Table Iris_sepal
pd.read_sql_query("select * from Iris_sepal",mydb)

In [ ]:
# Select Table Iris_species
pd.read_sql_query("select * from Iris_species",mydb)

In [ ]:
# Create Table members
cursor.execute("create Table member(member_id INT AUTO_INCREMENT PRIMARY KEY, name VARCHAR(100)  )")

In [ ]:
# Create Table committees
cursor.execute("create Table committees(committees_id INT AUTO_INCREMENT PRIMARY KEY, name VARCHAR(100)  )")

In [ ]:
# Inserting Values to member table
cursor.execute("INSERT INTO member(name) VALUES ('Ragu'),('Vicky'),('Thanigai'),('Deva'),('Jegan')")

In [ ]:
# Inserting Values to committees table
cursor.execute("INSERT INTO committees(name) VALUES ('Ragu'),('Vicky'),('Thanigai'),('Jegan')")

In [ ]:
# Viewing the Member table
pd.read_sql_query("select * from member",mydb)

In [ ]:
# Viewing the committees table
pd.read_sql_query("select * from committees",mydb)